# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [3]:
# 記得先 Import 正確的套件
import pandas as pd
import numpy as np

In [4]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [5]:
#計算每個不同種類 animal 的 age 的平均數
df.groupby('animal').age.mean()

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

In [9]:
#將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
df.sort_values(by=['age', 'visits'])

  animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
j    dog  3.0       1       no
b    cat  3.0       3      yes
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

In [11]:
#將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
df.priority.apply(lambda x: True if x=='yes' else False)

a     True
b     True
c    False
d     True
e    False
f    False
g    False
h     True
i    False
j    False
Name: priority, dtype: bool

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [14]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.332188  0.734946  0.248634
1  0.599247  0.129501  0.967092
2  0.251646  0.500492  0.276718
3  0.861921  0.674518  0.835350
4  0.644725  0.167734  0.757292

In [19]:
df.mean()

0    0.537945
1    0.441438
2    0.617017
dtype: float64

In [15]:
#該欄位的平均數
df - df.mean()

          0         1         2
0 -0.205758  0.293508 -0.368383
1  0.061302 -0.311937  0.350075
2 -0.286299  0.059054 -0.340299
3  0.323975  0.233080  0.218333
4  0.106780 -0.273705  0.140275

In [18]:
#該筆資料平均數
df.mean(axis=1)

0    0.438589
1    0.565280
2    0.342952
3    0.790596
4    0.523250
dtype: float64

In [20]:
#該筆資料平均數 sub()函數
df.sub(df.mean(axis=1), axis=0)

          0         1         2
0 -0.106401  0.296357 -0.189955
1  0.033967 -0.435779  0.401812
2 -0.091306  0.157540 -0.066234
3  0.071324 -0.116078  0.044754
4  0.121475 -0.355517  0.234042

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [21]:
df

          0         1         2
0  0.332188  0.734946  0.248634
1  0.599247  0.129501  0.967092
2  0.251646  0.500492  0.276718
3  0.861921  0.674518  0.835350
4  0.644725  0.167734  0.757292

In [30]:
#哪一筆的資料總合最小
df.sum(axis=1).sort_values()

2    1.028857
0    1.315767
4    1.569751
1    1.695840
3    2.371789
dtype: float64

In [ ]:
# 哪一欄位的資料總合最小

In [32]:
df.sum().sort_values()

1    2.207191
0    2.689727
2    3.085085
dtype: float64